In [3]:
import pandas as pd
import numpy as np

In [5]:
## csv--> comma separated values
df=pd.read_csv("Cars.csv")
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [6]:
df.info()  ## get to know how many columns n all

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [4]:
df.describe() ## details like mean and only the floating value columns will be taken into consideration not the categoral features will not be there 
## % are percentiles here

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [7]:
## if in csv file we replace , by ; then we can add a sep parameter inside read_csv
## df=pd.read_csv("Cars.csv",sep=';')
# to find unique category counts
df['mpg'].value_counts()

mpg
13.0    20
14.0    19
18.0    17
15.0    16
26.0    14
        ..
31.9     1
16.9     1
18.2     1
22.3     1
44.0     1
Name: count, Length: 129, dtype: int64

In [8]:
from io import StringIO,BytesIO

In [9]:
data=('col1,col2,col3\n'
      'x,y,1\n'
      'a,b,2\n'
      'c,d,3')
type(data)

str

In [10]:
pd.read_csv(StringIO(data))  ## StringIO treats the string (data) as a file

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [12]:
df=pd.read_csv(StringIO(data),usecols=['col1','col2'])  ## usecols displays only the columns specified
df
# df.to_csv("test.csv") --> converts data again to csv file

  col1 col2
0    x    y
1    a    b
2    c    d

In [12]:
## specifying column datatype
data=("a,b,c,d\n"
      "1,2,3,4\n"
      "5,6,7,8\n"
      "9,10,11,12")
print (data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [13]:
df=pd.read_csv(StringIO(data),dtype=object)  # object here means these data will be string
# df=pd.read_csv(StringIO(data),dtype=float)  this will make the datatype as float
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [19]:
df["a"][1]  ## it is a string

'5'

In [14]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float})  
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [19]:
data=('index,a,b,c\n'
      '4,apple,bat,5.7\n'
      '5,orange,cow,5.7')
pd.read_csv(StringIO(data),index_col=0)  ##when we dont want 1,2 etc index which comes by default

            a    b    c
index
4       apple  bat  5.7
5      orange  cow  5.7

In [20]:
data=('index,a,b,c\n'
      '4,apple,bat,5.7\n'
      '5,orange,cow,5.7')
pd.read_csv(StringIO(data))

   index       a    b    c
0      4   apple  bat  5.7
1      5  orange  cow  5.7

In [27]:
data=('a,b,c\n'
      '4,apple,bat,2\n'
      '5,orange,cow,3') ## here it will take 4 n 5 as index by default to avoid it we can use index_col=False
pd.read_csv(StringIO(data))

        a    b  c
4   apple  bat  2
5  orange  cow  3

In [28]:
data=('a,b,c\n'
      '4,apple,bat,2\n'
      '5,orange,cow,3')
pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [30]:
##quoting and escape char , very useful in NLP
data='a,b\n"hello,\\"Naina\\",nice to see you",5'
pd.read_csv(StringIO(data),escapechar='\\')

                               a  b
0  hello,"Naina",nice to see you  5

In [33]:
## URL to csv
# df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')
# df.head()
## IF WE DOWNLOAD THIS FILE IN THIS URL THEN THERE WILL BE \t WHICH WILL BE DISPLAYED HERE